tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# skhd, yabai
# defaults write com.apple.finder DisableAllAnimations -bool true
# killall Finder # or logout and login
#tap "koekeishiya/formulae"
#brew "koekeishiya/formulae/skhd"
#brew "koekeishiya/formulae/yabai"

# THE ONE TRUE EDITOR
tap "jimeh/emacs-builds"
cask "emacs-app-good"

# install afew manually
# pip3 install afew
brew "notmuch" # read mail in emacs
brew "isync" # mbsync, sync mail to localhost

# Modern Unix Tools
# See https://github.com/ibraheemdev/modern-unix
brew "jq"
brew "git-delta"
brew "bat"
#brew "exa"
brew "fd"
brew "fzf"
brew "cloc"
brew "ripgrep"
brew "tealdeer" # rust version tldr

brew "terminal-notifier" # for notification
brew "opensll" # used to build tdlib
brew "ffmpeg" # play things in telega
brew "neovim"
brew "tree" # see file tree in command line
brew "pandoc" # convert to pdf
brew "hugo" # Blogs
brew "sdcv" # Stardict console version
brew "graphviz" # for org-roam
brew "aspell" # for emacs spell check
#brew "hunspell" # for emacs spell check
#brew "bash" # Replace default 2.x bash
brew "bitwarden-cli" # use bitwarden in raycask
brew "clipper", restart_service: true
brew "coreutils" # gnu utils
brew "git"
brew "universal-ctags"
brew "global", args: ["force"] # pip3 install pygments for more languages support like go/rust
brew "gnupg"
brew "go"
brew "ipython"
brew "kubernetes-cli"
brew "libgccjit" # for emacs native-comp support
#brew "mpv" # play music in emacs
#brew "socat" # with mpv
#brew "neovim"
brew "pngpaste" # for org-download-clipboard
brew "tdlib", args: ["HEAD"]
brew "tmux"
brew "yadm" # Yet another dotfiles manager
#brew "golangci-lint" # lint for go codeAA
brew "mosh" # UDP ssh
brew "htop" # better top
brew "vim" # reinstall vim to add python3 support after alias python=python3

# brew "jupyterlab"

# Database command line tool
# brew pgcli
# brew litecli
# brew mongocli
# brew mycli

cask "anki"
cask "clashx-pro" # Say it!
cask "balenaetcher"
cask "basictex" # Export org to pdf
      # tlmgr update --self
      # tlmgr install wrapfig marvosym wasy wasysym capt-of
#cask "discord"
cask "docker"
cask "dropbox" # best file sync via cloud
cask "firefox" # default browser
cask "hiddenbar" # Hide icon in menu bar
cask "iina" # Media player
cask "iterm2" # terminal
cask "karabiner-elements" # Key remapping
#cask "keepingyouawake" # keep monitor on
cask "maczip" # Compress & extract
#cask "mounty" # Mounty for NTFS read/write
cask "miniconda" # python virtual env
cask "neteasemusic"
cask "netnewswire" # rss readeer
cask "raycast" # better spotlight
cask "squirrel" # input method
cask "syncthing" # sync file!
cask "the-unarchiver" # unrar
cask "thunder" # evil downloader!
cask "v2rayx"
cask "via" # modify keyboard
#cask "whichspace" # with yabai, show space number on menu bar
cask "wireshark"
#cask "next" # lisp browser

# wps? logi options?

#### FONT ####
cask "font-recursive"
cask "font-recursive-code" # Code editor default font
cask "font-cardo" # variable pitch font
cask "font-gnu-unifont"
#cask "font-sarasa-gothic" # 更纱黑体 太大了
case "font-latin-modern" # Emacs default english font

# mos
# bitwarden
# octotree
# tampermonkey
# step two
# microsoft remote desktop
# plash
