### Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

### THE ONE TRUE EDITOR
tap "jimeh/emacs-builds"
cask "emacs-app-good"
brew "xapian" # for xeft

### Mail
# install afew manually
# pip3 install afew
brew "notmuch" # read mail in emacs
brew "isync" # mbsync, sync mail to localhost

### Modern Unix Tools
# See https://github.com/ibraheemdev/modern-unix
brew "jq"
brew "git-delta"
#brew "exa"
brew "fd"
brew "fzf"
brew "cloc"
brew "ripgrep"
brew "tealdeer" # rust version tldr

### Programming
brew clojure/tools/clojure
brew openjdk # sudo ln -sfn /usr/local/opt/openjdk/libexec/openjdk.jdk /Library/Java/JavaVirtualMachines/openjdk.jdk
brew leiningen
brew "go"
brew "ipython"
brew "mit-scheme"
brew "deno"
brew "shellcheck" # check bash script

brew "texinfo" # for build emacs
brew "lrzsz" # send/recive single file from/to remote server
brew "typespeed"
brew "krew" # kubectl package manager, used to install kubectl-neat for now
brew "terminal-notifier" # for notification
brew "opensll" # used to build tdlib
brew "ffmpeg" # play things in telega
brew "tree" # see file tree in command line
brew "pandoc" # convert to pdf
brew "hugo" # Blogs
brew "sdcv" # Stardict console version
brew "graphviz" # for org-roam
brew "hunspell" # for emacs spell check
#brew "bash" # Replace default 2.x bash
brew "bitwarden-cli" # use bitwarden in raycask
brew "clipper", restart_service: true
brew "coreutils" # gnu utils
brew "git"
brew "universal-ctags"
brew "global", args: ["force"] # pip3 install pygments for more languages support like go/rust
brew "gnupg"
brew "kubernetes-cli"
brew "libgccjit" # for emacs native-comp support
#brew "mpv" # play music in emacs
#brew "socat" # with mpv
brew "pngpaste" # for org-download-clipboard
brew "tdlib", args: ["HEAD"]
brew "tmux"
brew "yadm" # Yet another dotfiles manager
brew "mosh" # UDP ssh
brew "htop" # better top

# Database command line tool
# brew pgcli
# brew litecli
# brew mongocli
# brew mycli

cask "spotify"
cask "easy-move-plus-resize"
cask "shottr" # screen shot
cask "anki"
cask "clashx-pro" # Say it!
cask "balenaetcher"
cask "basictex" # Export org to pdf
      # tlmgr update --self
      # tlmgr install wrapfig marvosym wasy wasysym capt-of
#cask "discord"
cask "docker"
cask "dropbox" # best file sync via cloud
cask "firefox" # default browser
cask "iina" # Media player
cask "karabiner-elements" # Key remapping
#cask "keepingyouawake" # keep monitor on
cask "maczip" # Compress & extract
cask "miniconda" # python virtual env
cask "netnewswire" # rss readeer
cask "raycast" # better spotlight
cask "squirrel" # input method
cask "syncthing" # sync file!
cask "the-unarchiver" # unrar
cask "via" # modify keyboard

# wps? logi options?

### Font
cask "font-sf-pro"
cask "font-gnu-unifont"

brew "font-util"
cask "font-iosevka"

brew "svn"
cask "font-ibm-plex-mono"

# English font
#cask "font-recursive"
cask "font-latin-modern"
cask "font-meslo-lg-nerd-font"
cask "font-mononoki"

# Chinese font
cask "font-lxgw-wenkai"
#cask "font-sarasa-gothic"

# Variable font
cask "font-cardo"
cask "font-dejavu" # serif

# Emoji font
cask "font-noto-emoji"
cast "font-noto-color-emoji"

# bitwarden
# octotree
# tampermonkey
# step two
# microsoft remote desktop
# plash
