jethrokuan/z
PatrickF1/fzf.fish
acomagu/fish-async-prompt
jorgebucaran/autopair.fish
jhillyerd/plugin-git
decors/fish-colored-man
wfxr/forgit
gazorby/fish-abbreviation-tips
